<%@ page language="java" contentType="text/html; charset=UTF-8"
	pageEncoding="UTF-8"%>
<%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c"%>

<!-- 이미지맵을 사용하기 위한 js파일-->
<%-- <script src="${pageContext.request.contextPath }/js/jquery-3.3.1.js"></script> --%>
<script
	src="${pageContext.request.contextPath }/js/jquery.imagemapster.js"></script>

<script type="text/javascript">
	<c:if test="${ not empty message}">
		<c:if test="${message eq 'create'}">
			swal("거래처 등록 완료", "거래처 등록이 완료되었습니다." , "success");
		</c:if>
		<c:if test="${message eq 'delete'}">
			swal("거래처 삭제 완료", "거래처 삭제가 완료되었습니다." , "success");
		</c:if>
	</c:if>

	//페이징 처리하기위한함수
	function paging(page){
		console.log(page);
		$("#searchHiddenForm").find("input[name='page']").val(page);
		$("#searchHiddenForm").submit();
	}


	$(document).ready(function() {
		
			//지도를 클릭했을때 발생하는 함수
				$(".area").on("click",function(event){
					event.preventDefault();
					var areas = $(this).attr('alt');
					 $("#local").val(areas);
					 var ll=  $("#local").val();
					console.log(areas);
					//hidden form값주고 submit
					$("#searchHiddenForm").submit();
				})
				
				$("#namebtn").on("click",function(event){
// 					var name = $(this).prevAll("input[name='cl_name1']").val($("#nameText").val()).value();
					$("#cl_nameID").val($("#nameText").val());
					var name1= $("#cl_nameID").val();
					console.log(name1);
					$("#searchHiddenForm").submit();
				})
				
				
				$("#themap").mapster = { //imagemapster.js를 사용하여 속성 설정 
					fillOpacity : 0.4, //채워지는 색의 불투명도  1은 불투명
					fillColor : "ff0000", //채워지는 색
					stroke : true, //영역의 선의 유무
					strokeColor : "ff0000", //선색
					strokeOpacity : 0.5, //선의 불투명도
					strokeWidth : 5, //선의 너비
					singleSelect : true, //선택은 하나만 가
					scaleMap : true, //이미지 맵을 이미지의 디스플레이 크기에 맞게 자동으로 스케일해줌
					mapKey : 'id', //아이디를 맵키
					listKey : 'id',
					showToolTip : false
				//툴팁을 사용하지 않음
				//toolTipClose: ["tooltip-click", "area-click"], //툴팁을 닫는 이벤트 정의[툴팁을 클릭했을 때, 툴팁이 닫힌다. , 지역선택하면 닫힘]
				};

				//클릭했을 때 발생하는 이벤트
				$("#searchHiddenForm").on("submit",	function() {
					
						var queryString = $(this).serialize();
						console.log(queryString);
						$.ajax({
							url:"${pageContext.request.contextPath}/purchasingTeam/buyerManage/buyerList",
							data : queryString,
							dataType:"json",
							success:function(resp){
								
								console.log(resp);
								var buyerList = resp.dataList;
								var pagingHTML = resp.pagignHTML;
								var trTags = [];
								
								var th =$("<tr>").append(
											$("<th>").text("거래처명")
											,$("<th>").text("주소")
											,$("<th>").text("상세주소")
											,$("<th>").text("전화번호")
										) 
								trTags.push(th);
								
			  					$(buyerList).each(function(idx,buyer){
									var tr = $("<tr>").prop("id",buyer.cl_no)
									.append(
												$("<td>").text(buyer.cl_name),
												$("<td>").text(buyer.cl_add1),
												$("<td>").text(buyer.cl_add2),
												$("<td>").text(buyer.cl_tel)
											);
									trTags.push(tr);
			
			  					});
						$("#listBody").html(trTags);
						$('#pagingArea').html(resp.pagingHTML);
					}	
						
						
				});
			return false;
		});
		//리스트바디의 tr 태그를 누르면 상세조회로 넘어간다.
		$("#listBody").on("click","tr",function(){
			var cl_no = $(this).prop("id");
			location.href="${pageContext.request.contextPath}/purchasingTeam/buyerManage/detailBuyer/"+cl_no;
		}).css({cursor:"pointer"});
				
		paging(1);		
	});
</script>

<h3>거래처 조회</h3>
<br>
<br>
<div class="col-xs-5 col-md-12">
	<div class="row">
	  
		<form id="searchHiddenForm">
			<input type="hidden" name ="local" id="local"/>
			<input type="hidden" name="cl_name" id="cl_nameID"/>
			<input type="hidden" name="page" />
		</form>
  
		<div class="mapdiv">
			<!-- 이미지의 크기를 잡아주기 위해 div로 묶어줌 -->
			<!-- 이미지 가져오기 usemap 속성을 사용하여 이미지맵의 이름을 지정해 주어야 한다 이때 이름은 map의 name값의 앞에 #을 붙인것과 같아야한다. -->
			<img id="themap" class="map col"
				src="<%=request.getContextPath()%>/images/imagemap.gif" usemap="#kr"
				border="0" width="400" height="551" orgWidth="408" orgHeight="551"
				alt="" />
			<map name="kr" id="krmap">
  
				<!--area로 이미지의 영역을 지정해줌. shape='poly': 다각형모양, coords는 이미지의 좌표값 -->
				<area id="kangwondo" class="area" alt="강원" href="#" shape="poly"
					coords="229,11,226,38,221,38,214,33,210,27,208,24,204,30,197,31,192,25,185,24,174,27,167,33,158,32,151,28,149,27,147,38,145,45,139,43,137,41,135,46,127,43,125,48,136,60,144,67,152,67,158,77,166,84,161,94,161,106,162,118,173,120,184,123,183,131,181,142,181,156,184,168,195,166,201,157,210,162,219,158,226,160,224,170,233,168,241,172,246,170,255,174,265,177,269,172,277,176,282,173,292,174,296,169,304,174,317,166,317,157,298,127,290,114,282,96,271,88,257,67,254,63,242,33" />
				<area id="seoul" class="area" alt="서울" href="#" shape="poly"
					coords="116,142,117,135,113,137,101,134,100,128,97,126,99,120,105,118,111,114,114,111,124,116,128,129,125,134" />
				<area id="kyunggido" class="area" alt="경기" href="#" shape="poly"
					coords="117,50,113,62,106,63,98,63,97,68,94,74,89,78,86,83,88,96,85,102,78,103,74,107,77,120,85,120,97,122,102,120,109,118,116,115,123,116,130,121,129,128,128,132,123,138,117,137,109,137,100,136,96,130,94,140,91,142,89,141,88,142,98,153,94,157,88,162,89,174,98,169,96,181,104,189,111,194,124,191,131,188,140,189,147,189,153,183,158,179,168,176,172,171,176,169,180,164,181,149,185,138,183,129,188,125,178,122,171,115,162,116,163,108,159,106,161,100,161,93,166,89,167,83,163,80,161,78,157,76,154,72,153,67,148,68,143,67,139,65,140,62,135,63,134,60,131,57,128,53,124,51" />
				<area id="incheon" class="area" alt="인천" href="#" shape="poly"
					coords="80,121,86,119,87,118,94,120,97,132,96,140,92,142,88,142,83,136,83,133,80,134,79,125" />
				<area id="chungnam" class="area" alt="충남" href="#" shape="poly"
					coords="137,191,128,187,120,190,109,193,101,194,97,190,90,184,82,183,76,178,71,181,61,182,60,188,67,193,61,200,57,202,56,195,52,197,48,195,44,203,50,212,56,220,55,227,67,227,72,246,78,253,73,259,75,271,81,278,87,289,94,290,101,288,106,279,112,275,120,276,119,283,127,284,141,280,144,278,148,290,158,292,164,291,169,290,171,285,169,278,169,268,160,265,155,268,150,266,147,270,141,268,139,259,140,249,144,245,148,242,148,237,146,230,141,225,144,215,147,209,151,207,148,202" />
				<area id="daejeon" class="area" alt="대전" href="#" shape="poly"
					coords="149,239,142,244,139,248,138,259,146,271,150,268,158,267,160,263,163,259,164,250,158,246,157,242" />
				<area id="chungbuk" class="area" alt="충북" href="#" shape="poly"
					coords="253,176,247,174,245,170,239,171,234,170,231,167,225,168,224,165,227,162,220,160,218,158,213,160,207,162,204,162,202,158,198,156,195,160,194,166,189,167,181,167,180,165,179,163,177,166,173,169,171,175,166,177,162,177,156,177,152,184,148,188,143,189,139,190,138,192,145,202,151,205,144,210,142,218,141,223,147,233,146,240,153,241,159,243,165,251,163,257,160,259,159,263,158,265,166,271,170,283,177,285,185,287,192,287,199,285,201,275,201,268,206,267,203,262,195,260,191,259,192,252,192,248,193,239,194,234,191,229,187,229,186,226,189,222,196,224,196,221,196,216,202,214,208,215,208,210,206,206,212,202,219,202,223,198,232,203,239,201,239,194,242,188,244,185,246,182" />
				<area id="kyungbuk" class="area" alt="경북" href="#" shape="poly"
					coords="317,165,311,169,306,174,301,174,295,171,289,173,283,172,277,176,273,176,270,172,266,176,260,178,257,175,254,179,252,178,248,184,239,190,238,193,236,202,229,204,223,198,219,203,213,203,208,203,206,207,204,214,200,213,195,217,192,223,188,224,186,229,193,236,192,245,190,255,199,261,206,265,202,274,198,280,193,287,192,294,190,301,200,304,207,308,216,312,220,328,236,329,239,319,234,313,234,303,240,295,246,299,250,292,254,290,260,287,269,296,268,306,264,309,262,319,257,321,253,318,250,323,247,327,253,336,261,333,268,335,273,334,277,333,281,329,286,328,294,327,299,320,303,318,311,318,310,320,317,324,321,323,328,324,332,318,334,306,336,296,340,282,336,279,332,283,330,287,327,287,322,283,326,280,325,274,324,270,322,268,324,262,322,247,326,244,326,237,326,230,325,219,329,213,328,209,326,205,324,196,323,189,324,182,323,178,323,175" />
				<area id="daegu" class="area" alt="대구" href="#" shape="poly"
					coords="259,287,256,287,252,291,247,298,244,301,243,296,238,299,237,302,236,308,235,315,242,320,241,324,234,322,240,331,248,324,254,320,262,319,264,311,268,306,271,300,266,296,266,293,266,290" />
				<area id="jeonbuk" class="area" alt="전북" href="#" shape="poly"
					coords="190,286,184,288,178,286,174,284,169,286,166,288,161,291,160,293,155,292,152,290,148,289,146,287,146,283,145,279,142,276,140,276,138,278,129,282,126,284,122,283,119,280,118,277,116,275,113,275,111,274,106,276,105,281,104,285,100,286,97,286,93,290,85,289,81,292,78,295,84,304,91,311,84,316,82,321,77,323,72,327,70,330,80,335,79,339,73,342,69,345,67,349,73,357,80,362,88,362,92,358,94,350,95,346,101,345,110,352,118,350,119,362,129,364,139,363,148,364,155,361,161,359,169,360,173,356,173,352,171,343,168,340,170,330,176,317,177,312,178,308,187,306,194,299,196,296" />
				<area id="gwangju" class="area" alt="광주" href="#" shape="poly"
					coords="102,373,97,372,93,371,89,375,86,378,85,384,93,387,100,391,110,391,115,388,115,383,115,379,113,375,111,371,109,368" />
				<area id="jeonnam" class="area" alt="전남" href="#" shape="poly"
					coords="167,366,164,361,160,359,156,358,153,360,149,364,142,364,134,363,130,362,128,364,125,366,122,364,120,362,121,360,119,356,118,353,119,349,115,347,113,354,109,355,103,350,101,345,96,345,93,351,91,359,88,361,83,360,79,362,75,363,72,360,72,356,70,353,68,351,65,350,64,352,62,359,61,363,58,368,56,370,62,380,68,388,60,387,56,383,52,380,51,382,49,384,43,388,56,395,54,399,61,407,60,414,60,427,55,425,52,422,52,435,59,445,67,449,71,462,77,472,83,465,87,462,92,459,95,453,105,457,111,456,115,444,121,436,127,431,135,427,139,425,134,435,127,445,135,448,142,454,149,452,155,448,154,443,160,442,160,435,154,429,151,426,151,418,158,415,163,414,165,426,172,435,173,425,181,426,183,421,183,412,176,414,171,412,169,409,169,406,177,406,183,403,184,393,179,388,174,381" />
				<area id="kyungnam" class="area" alt="경남" href="#" shape="poly"
					coords="193,300,187,305,179,311,174,316,172,323,169,336,168,337,174,348,173,354,170,357,168,363,165,367,172,376,179,388,185,395,183,402,191,405,186,414,192,422,202,429,210,424,212,421,213,415,210,411,207,406,201,407,199,414,197,410,198,403,198,401,201,398,205,397,213,401,221,405,225,404,232,411,239,418,245,417,251,416,254,415,256,430,266,426,265,420,271,414,270,409,268,405,266,399,266,396,263,394,259,397,257,405,253,406,248,406,243,403,243,398,248,396,246,393,246,388,246,384,252,387,260,391,258,384,259,382,266,385,274,385,282,376,289,371,298,368,302,359,307,354,307,351,301,345,298,340,290,338,289,335,292,332,291,330,287,329,281,326,279,334,273,334,267,335,262,335,255,334,250,329,247,325,244,328,240,331,235,329,233,328,231,325,227,327,222,328,216,327,219,324,219,321,219,319,216,313,212,311,208,309,203,308,199,306" />
				<area id="ulsan" class="area" alt="울산" href="#" shape="poly"
					coords="329,325,322,324,319,323,316,325,312,323,310,321,303,319,298,320,294,326,291,330,288,336,295,344,304,349,313,355,320,359,322,352,322,347,327,342,329,338" />
				<area id="busan" class="area" alt="부산" href="#" shape="poly"
					coords="317,361,315,356,310,354,308,356,304,358,302,356,300,363,296,369,291,372,285,374,279,375,277,379,272,386,284,390,291,390,298,384,304,384,310,377,314,372,316,370" />
				<area id="jeju" class="area" alt="제주" href="#" shape="poly"
					coords="111,502,101,499,89,499,78,501,75,505,68,505,63,507,58,513,53,519,48,525,55,538,65,534,79,535,90,533,97,531,105,529,110,526,116,516,117,512" />
			</map>
		</div>
		
		<br>
		<br>
		<div class="col">
			<div class="col-xs-12 col-md-3 offset-md-9 form-group input-group">
				<input type="text" class="form-control" placeholder="거래처명"
					id="nameText" name="cl_name1"
					value="${pagingVO.searchData.cl_name }"> 
				<span class="input-group-btn searchWrap"> 
				<!--	페이징처리 하기위한 폼 -->
				<input type="hidden" name="page" />
				<button class="btn btn-default btnSearch" type="button"	id="namebtn">
					<i class="fa fa-search" style="color: #007bff"></i>
				</button>
				</span>
			</div>
			<table class="table table-boarderless table-hover">
<!-- 			테이블바디 -->
				<tbody id="listBody">
				
				</tbody>
<!-- 						페이징처리 -->
				<tfoot>
					<tr>
						<td colspan="4" id="pagingArea">${pagingVO.pagingHTML }</td>
					</tr>
				</tfoot>
			</table>
		</div>
		
	</div>
	
<!-- 	<div class="col"> -->
<!-- 		<div style="float: right;"> -->
<!-- 			<button class="btn btn-primary" -->
<%-- 				onclick="location.href='<c:url value="/salesTeam/buyerManage/buyerInsert" />';">거래처 --%>
<!-- 				신규등록</button> -->
<!-- 		</div> -->
<!-- 	</div> -->
</div>
